{
  "Background": [
    "A young man named Sun Xiaochuan had his families all slaughtered by the Wolf Warrior. With endless and eternal fury of losing what he loved, he decided to cultivate himself getting stronger in order to fulfill his revenge and bring tranquility back to this world."
  ],
  "Chapter 1": [
    "\"Where is this? Why am I here\" the boy said dazedly. Suddenly, he seemed to realize something and rushed out the door...",
    "Sun found out that all his families was brutally killed while other citizens were safe. He anxiously asked everyone in the city, but no one would care about him. Finally, an old wiseman told him the truth (NPC communication here, content TBD):",
    "After few days, he started his journey for revenge with wrath and a sword that is inherited from his father."
  ],
  "Chapter 2-1": [
    "First of all, Sun walked into the twisted timberland where he could get elderwood to build the hardest armor defending the magical attack from Wolf Warrior.  In order to get the elderwood, Sun must defeat the guardian of this timberland that is Goblin (NPC communication and battle here, content TBD)"
  ],
  "Chapter 2-2": [
    "Having forged the hardest armor, Sun still remembered that he promised that he would bring Saussure Involucrate back to the wiseman because only if the wiseman gets it, he would tell him the way to look for Wolf Warrior. Therefore, Sun came to the Abstract Mountain and he must defeat the guardian here that is Slime (NPC communication and battle here, content TBD)"
  ],
  "Chapter 2-3": [
    "Having obtained the Saussure Involucrate, Sun came back to stormwind city and traded with the wiseman that the wiseman told him where to find the Wolf Warrior (NPC communication and battle here, content TBD). ",
    "The ultimate battle is about to begin."
  ],
  "Chapter 3": [
    "Sun finally met and had an opportunity to kill the Wolf Warrior (NPC communication and battle here, content TBD).",
    "After revenging for his families, Sun chose to suicide, because he had no nostalgia for this world."
  ]
}